БухЭксп/Catalogs/CW_ОбъектыАрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбъектыАрхива</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ВладельцыАрхива</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла без расширения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТомаАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗахвачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийРедактор</Name>
					<Comment>Пользователь захвативший файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗагружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВОблаке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАрхиваВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХраненияАрхива</Name>
					<Comment>0 - прикреплен,1 - в облаке; 2 - ссылка на ранее прикрепленный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОбъектыАрхива/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ЕстьПрикрикрепленныеФайлыОбъекта(Объект) Экспорт
	
	ВладелецФАйлов = CW_РаботаСФайламиСервер.ПолучитьВладельцаАрхиваПоОбъекту(Объект, Ложь);
	Если Не ЗначениеЗаполнено(ВладелецФАйлов) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ОбъектыАрхива.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ОбъектыАрхива КАК CW_ОбъектыАрхива
	               |ГДЕ
	               |	CW_ОбъектыАрхива.Владелец = &ВладелецФайлов";
	Запрос.УстановитьПараметр("ВладелецФайлов", ВладелецФайлов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ДобавитьСсылкуНаОбъектАрхиваДляВыбранныхГрузоперевозок(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	Для Каждого ЭлементСписка из ПараметрыПроцедуры.ВыбранныеЭлементы Цикл
		
		Если Не ЭлементСписка.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйОбъектАрхива = ПараметрыПроцедуры.ОбъектАрхива.Скопировать();
		НовыйОбъектАрхива.Владелец 				= ЭлементСписка.Значение;
		НовыйОбъектАрхива.Объект 				= ЭлементСписка.Значение;
		НовыйОбъектАрхива.ОбъектАрхиваВладелец 	= ПараметрыПроцедуры.ОбъектАрхива;
		НовыйОбъектАрхива.Записать();
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ПараметрыПроцедуры.ВыбранныеЭлементы.Количество(),АдресРезультата);
	
КонецПроцедуры

Процедура ПолучитьДеревоФайлов(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	МассивОбъектовАрхива = Новый Массив;

	ПолучитьМассивОбъектовАрхива(ПараметрыПроцедуры.ВладелецФайлов, МассивОбъектовАрхива);

	ДополнитьМассивСсылок(МассивОбъектовАрхива);
	
	ДеревоЗначений = ПараметрыПроцедуры.ДеревоЗначений;
	
	ЗаполнитьДеревоНаСервере(МассивОбъектовАрхива, ДеревоЗначений);
	
	ПоместитьВоВременноеХранилище(ДеревоЗначений, АдресРезультата);
	
КонецПроцедуры  
  
Процедура ПолучитьМассивОбъектовАрхива(ТекущаяСсылка, МассивОбъектовАрхива)
	
	УстановитьПривилегированныйРежим(Истина);

	МетаданныеОбъекта = ТекущаяСсылка.Метаданные();
	
	Если Не Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ТекущаяСсылка))
		И не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ТекущаяСсылка)) Тогда
		Возврат;
	КонецЕсли; 

	//Стандартные реквизиты объекта метаданных
	ОбработатьРеквизитыОбъекта(ТекущаяСсылка, МетаданныеОбъекта.СтандартныеРеквизиты, МассивОбъектовАрхива);
	
	//Реквизиты объекта метаданных
	ОбработатьРеквизитыОбъекта(ТекущаяСсылка, МетаданныеОбъекта.Реквизиты, МассивОбъектовАрхива);
	
	//Табличные части объекта метаданных
	Для Каждого ТабличнаяЧасть из МетаданныеОбъекта.ТабличныеЧасти Цикл 
		
		ТабличнаяЧастьОбъекта = ТекущаяСсылка[ТабличнаяЧасть.Имя];
		
		Для Каждого Реквизит из ТабличнаяЧасть.Реквизиты Цикл 
			
			Для Каждого СтрокаТаблицы из ТабличнаяЧастьОбъекта Цикл
				
				ЗначениеРеквизита = СтрокаТаблицы[Реквизит.Имя];  
				Если Не ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
					Продолжить;
				КонецЕсли;
				
				Если Не Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗначениеРеквизита))
					И Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗначениеРеквизита)) Тогда
					Продолжить;
				КонецЕсли; 
				
				Если МассивОбъектовАрхива.Найти(ЗначениеРеквизита) = Неопределено Тогда
					МассивОбъектовАрхива.Добавить(ЗначениеРеквизита);	
					ПолучитьМассивОбъектовАрхива(ЗначениеРеквизита, МассивОбъектовАрхива);	
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;  
	
КонецПроцедуры

// Процедура - Дополнить массив ссылок
//	Расширяемая процедура, позволяющая дополнить массив полученных ссылок произвольными ссылками
//
// Параметры:
//  МассивОбъектовАрхива - исхдный массив ссылок, полученные по объекту архива.
//
Процедура ДополнитьМассивСсылок(МассивОбъектовАрхива)

	Справочники.CW_ПриложенияКДоговорам.ДополнитьМассивСсылок(МассивОбъектовАрхива);
	
КонецПроцедуры

Процедура ОбработатьРеквизитыОбъекта(Знач ДанныеОбъекта, Знач Реквизиты, МассивОбъектовАрхива)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Реквизит из Реквизиты Цикл 
		
		Если Реквизит.Имя = "Ссылка" Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеРеквизита = ДанныеОбъекта[Реквизит.Имя];  
		Если Не ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗначениеРеквизита))
			И Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗначениеРеквизита)) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если МассивОбъектовАрхива.Найти(ЗначениеРеквизита) = Неопределено Тогда
			МассивОбъектовАрхива.Добавить(ЗначениеРеквизита);	
			ПолучитьМассивОбъектовАрхива(ЗначениеРеквизита, МассивОбъектовАрхива);	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНаСервере(МассивОбъектовАрхива, ДеревоЗначений)

	Модуль_РаботаСФайлами = CW_РаботаСФайламиСервер.ПолучитьОбщийМодульРаботыСфайлами();
	
	МассивВладелецевАрхива = Новый Массив;
	Для Каждого СсылкаВМассиве из МассивОбъектовАрхива Цикл
		
		ВладелецАрхива = CW_РаботаСФайламиСервер.ПолучитьВладельцаАрхиваПоОбъекту(СсылкаВМассиве, Ложь);
		Если Не ЗначениеЗаполнено(ВладелецАрхива) Тогда
			Продолжить;
		КонецЕсли;
		
		Если МассивВладелецевАрхива.Найти(ВладелецАрхива) =Неопределено Тогда
			МассивВладелецевАрхива.Добавить(ВладелецАрхива);	
		КонецЕсли;
	КонецЦикла;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТИПЗНАЧЕНИЯ(CW_ОбъектыАрхива.Владелец.ОбъектАрхива) КАК ТипОбъекта,
	|	CW_ОбъектыАрхива.Владелец КАК Владелец,
	|	CW_ОбъектыАрхива.Ссылка КАК Ссылка,
	|	CW_ОбъектыАрхива.Расширение КАК Расширение,
	|	CW_ОбъектыАрхива.ТипДокумента КАК ТипДокумента,
	|	CW_ОбъектыАрхива.СпособХраненияАрхива КАК СпособХраненияАрхива
	|ИЗ
	|	Справочник.CW_ОбъектыАрхива КАК CW_ОбъектыАрхива
	|ГДЕ
	|	CW_ОбъектыАрхива.Владелец В(&МассивВладелецев)
	|	И CW_ОбъектыАрхива.ПометкаУдаления = ЛОЖЬ
	|	И CW_ОбъектыАрхива.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипОбъекта,
	|	CW_ОбъектыАрхива.Владелец,
	|	Ссылка
	|ИТОГИ ПО
	|	ТипОбъекта,
	|	Владелец
	|АВТОУПОРЯДОЧИВАНИЕ"; 
	
	Запрос.УстановитьПараметр("МассивВладелецев", МассивВладелецевАрхива);
	
	РезультатЗапроса = Запрос.Выполнить();    
	
	ВыборкаТипОбъекта = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТипОбъекта.Следующий() Цикл
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ВыборкаТипОбъекта.ТипОбъекта);

		ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
		
		ПустаяСсылка = ОписаниеТипа.ПривестиЗначение(Неопределено);
		
		СтрокаТипОбъекта = ДеревоЗначений.Строки.Добавить();
		СтрокаТипОбъекта.ИндексКартинки	= 2;
		СтрокаТипОбъекта.ЭтоГруппа		= Истина;
		СтрокаТипОбъекта.Наименование	= ПустаяСсылка.Метаданные().Синоним;	
		
		ВыборкаВладелец = ВыборкаТипОбъекта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВладелец.Следующий() Цикл
			
			ВыборкаФайлыВладельца = ВыборкаВладелец.Выбрать();  
			
			Строкаобъекта = СтрокаТипОбъекта.Строки.Добавить();
			Строкаобъекта.ЭтоГруппа         = Истина;
			Строкаобъекта.ИндексКартинки 	= 0;
			Строкаобъекта.Наименование 		= СокрЛП(ВыборкаВладелец.Владелец);	
			Строкаобъекта.Объект       		= ВыборкаВладелец.Ссылка;
			
			Пока ВыборкаФайлыВладельца.Следующий() Цикл
				СтрокаФайла = Строкаобъекта.Строки.Добавить();
				СтрокаФайла.ЭтоГруппа				= Ложь;
				СтрокаФайла.Наименование			= СокрЛП(ВыборкаФайлыВладельца.Ссылка);	
				СтрокаФайла.Объект					= ВыборкаФайлыВладельца.Ссылка;
				СтрокаФайла.ИндексКартинки			= Модуль_РаботаСФайлами.ПолучитьИндексПиктограммыФайла(ВыборкаФайлыВладельца.Расширение);   
				СтрокаФайла.ТипДокумента			= ВыборкаФайлыВладельца.ТипДокумента;
				СтрокаФайла.Расширение				= ВыборкаФайлыВладельца.Расширение;
				СтрокаФайла.СпособХраненияАрхива	= ВыборкаФайлыВладельца.СпособХраненияАрхива;
			КонецЦикла;
			
		КонецЦикла; 
		
	КонецЦикла;    
	
КонецПроцедуры 

Процедура УдалитьСвязанныеСсылки(Ссылка) Экспорт  
	
	УдаляемыеСсылки = Новый Массив;
	УдаляемыеСсылки.Добавить(Ссылка);   
	
	ЗаполнитьМассивСвязанныхСсылок(УдаляемыеСсылки); 
	
	УдаляемыеСсылки.Удалить(УдаляемыеСсылки.Найти(Ссылка));
	
	Для Каждого УдаляемаяСсылка из УдаляемыеСсылки Цикл
		УдаляемыйОбъект = УдаляемаяСсылка.ПолучитьОбъект(); 
		Если УдаляемыйОбъект <> Неопределено Тогда
			УдаляемыйОбъект.Удалить();               
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьМассивСвязанныхСсылок(УдаляемыеСсылки)
	
	//Рекурсивно собираем все ссылки, которые ссылкаются на удаляемые объекты архива
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбъектыАрхива.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ОбъектыАрхива КАК CW_ОбъектыАрхива
	               |ГДЕ
	               |	CW_ОбъектыАрхива.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ОбъектыАрхива.ОбъектАрхиваВладелец В(&УдаляемыеСсылки)
	               |	И НЕ CW_ОбъектыАрхива.Ссылка В (&УдаляемыеСсылки)";  
	
	Запрос.УстановитьПараметр("УдаляемыеСсылки", УдаляемыеСсылки);  
	
	РезультатЗапроса = Запрос.Выполнить();  
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		УдаляемыеСсылки.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	ЗаполнитьМассивСвязанныхСсылок(УдаляемыеСсылки);

КонецПроцедуры 

Процедура ЗаполнитьСписокХраненияАрхива() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбъектыАрхива.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ОбъектыАрхива КАК CW_ОбъектыАрхива
	               |ГДЕ
	               |	CW_ОбъектыАрхива.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ОбъектыАрхива.ВОблаке = ИСТИНА";   
	
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		АрхивОбъект = Выборка.Ссылка.ПолучитьОбъект();  
		АрхивОбъект.СпособХраненияАрхива = 1;
		АрхивОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры  

Процедура ЗаполнитьВладельцаАрхива() ЭКспорт
	
	Пока Истина Цикл   
		
		//Обрабатываем порциями по 1000 элементов, чтобы не повесить систему.
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1000
		|	CW_ОбъектыАрхива.Ссылка КАК Ссылка,
		|	CW_ОбъектыАрхива.Объект КАК Объект
		|ИЗ
		|	Справочник.CW_ОбъектыАрхива КАК CW_ОбъектыАрхива
		|ГДЕ
		|	CW_ОбъектыАрхива.Владелец = Значение(Справочник.CW_ВладельцыАрхива.ПустаяСсылка)";
		
		РезультатЗапроса = Запрос.Выполнить();  
		
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли; 
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ВладелецАрхива = CW_РаботаСФайламиСервер.ПолучитьВладельцаАрхиваПоОбъекту(Выборка.Объект);
			
			АрхивОбъект = Выборка.Ссылка.ПолучитьОбъект();  
			АрхивОбъект.Владелец = ВладелецАрхива; 
			
			АрхивОбъект.ОбменДанными.Загрузка = Истина;
			АрхивОбъект.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
